app/Controllers/Home.php

    public function tambahAlternatif()
    {
        // Buat instance dari model M_Alternatif
        $alternatifModel = new M_Alternatif();

        // Ambil data alternatif dari tabel alternatif
        $data['alternatifData'] = $alternatifModel->findAll();
---
SELECT *
FROM `alternatif`