app/Controllers/Home.php

    public function hasil($topic = null)
    {
        $hasilModel = new M_Hasil();
        $alternatifModel = new M_Alternatif();

        // Jika $topic tidak null, ambil data hasil berdasarkan topic
        if ($topic !== null) {
            $data['hasilData'] = $hasilModel->getDataByTopic(urldecode($topic));
        } else {
            // Jika $topic null, ambil semua data hasil
            $data['hasilData'] = $hasilModel->findAll();
        }

        // Mengambil daftar semua topic untuk filter
        $data['allTopics'] = $alternatifModel->select('topic')->distinct()->findAll();
---
SELECT *
FROM `hasil`
SELECT DISTINCT `topic`
FROM `alternatif`

    public function hapus($id)
    {
        $hasilModel = new M_Hasil();
        $result = $hasilModel->delete($id);
---
DELETE FROM `hasil`
WHERE `id` IN ('170')