app/Controllers/Home.php

SELECT *
FROM `alternatif`
---
    public function index()
    {
        $alternatifModel = new M_Alternatif();

        // Cek apakah ada data hasil perhitungan dari formulir sebelumnya
        if ($this->request->getMethod() == 'post') {
            // Ambil data dari form
            $nilaiAkademik = $this->request->getPost('nilai_akademik');
            $historiProjek = $this->request->getPost('h_projek');
            $pelatihan = $this->request->getPost('pelatihan');
            $minat = $this->request->getPost('minat');
            $kemampuan = $this->request->getPost('kemampuan');

            // Hitung data menggunakan metode SAW
            $hasilPerhitungan = $this->hitungSAW($nilaiAkademik, $historiProjek, $pelatihan, $minat, $kemampuan);

            // Pass hasil perhitungan ke view
            $data['hasilPerhitungan'] = $hasilPerhitungan;
        }

        // Ambil data alternatif
        $data['alternatifOptions'] = $alternatifModel->findAll();

SELECT *
FROM `alternatif`
---
    public function prosesForm()
    {
        // Ambil data dari form
        $nilaiAkademik = $this->request->getPost('nilai_akademik');
        $historiProjek = $this->request->getPost('h_projek');
        $pelatihan = $this->request->getPost('pelatihan');
        $minat = $this->request->getPost('minat');
        $kemampuan = $this->request->getPost('kemampuan');

        // Simpan nama dan nim ke dalam variabel
        $nama = $this->request->getPost('nama');
        $nim = $this->request->getPost('nim');

        // Hitung data menggunakan metode SAW
        $hasilPerhitungan = $this->hitungSAW($nilaiAkademik, $historiProjek, $pelatihan, $minat, $kemampuan, $nama, $nim);

        // Ambil data alternatif (diperlukan untuk menampilkan form lagi)
        $alternatifModel = new M_Alternatif();
        $data['alternatifOptions'] = $alternatifModel->findAll();

SELECT *
FROM `hasil`
SELECT DISTINCT `topic`
FROM `alternatif`
---
    public function hasil($topic = null)
    {
        $hasilModel = new M_Hasil();
        $alternatifModel = new M_Alternatif();

        // Jika $topic tidak null, ambil data hasil berdasarkan topic
        if ($topic !== null) {
            $data['hasilData'] = $hasilModel->getDataByTopic(urldecode($topic));
        } else {
            // Jika $topic null, ambil semua data hasil
            $data['hasilData'] = $hasilModel->findAll();
        }

        // Mengambil daftar semua topic untuk filter
        $data['allTopics'] = $alternatifModel->select('topic')->distinct()->findAll();

DELETE FROM `hasil`
WHERE `id` IN ('200')
---
    public function hapus($id)
    {
        $hasilModel = new M_Hasil();
        $result = $hasilModel->delete($id);

SELECT *
FROM `alternatif`
---
    public function tambahAlternatif()
    {
        // Buat instance dari model M_Alternatif
        $alternatifModel = new M_Alternatif();

        // Ambil data alternatif dari tabel alternatif
        $data['alternatifData'] = $alternatifModel->findAll();

DELETE FROM `alternatif`
WHERE `id` IN ('9')
SELECT *
FROM `alternatif`
---
    public function hapusAlternatif($id)
    {
        // Buat instance dari model M_Alternatif
        $alternatifModel = new M_Alternatif();

        // Hapus alternatif berdasarkan ID
        $alternatifModel->delete($id);

        // Redirect ke halaman tambah_alternatif
        return redirect()->to(base_url('tambah'))->with('success', 'Alternatif berhasil dihapus.');

SELECT *
FROM `alternatif`
WHERE `alternatif`.`id` = '2'
---
    public function editAlternatif($id)
    {
        // Buat instance dari model M_Alternatif
        $alternatifModel = new M_Alternatif();

        // Ambil data alternatif berdasarkan ID
        $data['alternatif'] = $alternatifModel->find($id);