app/Models/M_Hasil.php

    public function simpanHasil($data)
    {
        $this->insert($data);
---
INSERT INTO `hasil` (`nama`, `nim`, `rekomendasi`) VALUES ('joko', '1235649', 'Data Mining')